# -*- coding: utf-8 -*-

basemap = {
    "'": {
    'A': u"Á",
    'E': u"É",
    'I': u"Í",
    'O': u"Ó",
    'U': u"Ú",
    'Y': u"Ý",
    'a': u"á",
    'e': u"é",
    'i': u"í",
    'o': u"ó",
    'u': u"ú",
    'y': u"ý",
    },
    
    "`": {
    'A': u"À",
    'E': u"È",
    'I': u"Ì",
    'O': u"Ò",
    'U': u"Ù",
    'a': u"à",
    'e': u"è",
    'i': u"ì",
    'o': u"ò",
    'u': u"ù",
    },
    
    "^": {
    'A': u"Â",
    'E': u"Ê",
    'I': u"Î",
    'O': u"Ô",
    'U': u"Û",
    'a': u"â",
    'e': u"ê",
    'i': u"î",
    'o': u"ô",
    'u': u"û",
    },

    '"': {
    'A': u"Ä",
    'E': u"Ë",
    'I': u"Ï",
    'O': u"Ö",
    'U': u"Ü",
    'a': u"ä",
    'e': u"ë",
    'i': u"ï",
    'o': u"ö",
    'u': u"ü",
    'y': u"ÿ",
    },

    "c": {
    'C': u"Ç",
    'c': u"ç",
    },

    
    "~": {
    'A': u"Ã",
    'O': u"Õ",
    'a': u"ã",
    'o': u"õ",
    'n': u"ñ",
    'N': u"Ñ",
    },
    
}
